src/test/resources/__files/standalone_credit/patch_standalone_credit_response.json

{
  "id": "a2afe762-2421-4d57-9c5e-17b06bfb2af6",
  "paymentType": "INTERAC_ETRANSFER",
  "paymentHandleToken": "PHd60LCJQPyqUM7N",
  "merchantRefNum": "7830cff4-6ce0-4994-9be2-65a36710d8f7",
  "currencyCode": "CAD",
  "txnTime": "2022-10-26T08:40:10Z",
  "customerIp": "172.0.0.1",
  "status": "FAILED",
  "gatewayReconciliationId": "b9fd71e7-f8d4-442b-be4e-e2c7990b8015",
  "amount": 121,
  "liveMode": false,
  "simulator": "EXTERNAL",
  "updatedTime": "2022-10-26T08:40:17Z",
  "statusTime": "2022-10-26T08:40:17Z",
  "gatewayResponse": {
    "id": "fg27oxf2w6mAgWyX",
    "processor": "PEOPLE_TRUST",
    "status": "ACCEPTED"
  },
  "interacEtransfer": {
    "consumerId": "madhuauto@paysafe.com",
    "question": "what is your name",
    "answer": "MadhuBaddam",
    "maxAmount": 500000,
    "fraudStatus": "CONFIRM_FRAUD",
    "fraudType": "FRAUD_BUSINESS",
    "comments": "Valid Txn",
    "transferType": "ALIAS_REGULAR"
  },
  "profile": {
    "firstName": "Madhu",
    "lastName": "Baddam",
    "email": "madhu.baddam@paysafe.com",
    "phone": "12345678"
  },
  "paymentFacilitator": {
    "subMerchant": {
      "id": "123456789",
      "name": "PayFacSubMerchant",
      "phone": "478234562331",
      "email": "payfac@mail.com",
      "url": "www.payfac.com",
      "address": {
        "street": "100 Queen Street West",
        "city": "Toronto",
        "state": "ON",
        "country": "CA",
        "zip": "M5H 2N2"
      }
    }
  }
}